In [214]:
import pandas as pd

In [215]:
route=pd.read_csv('route.csv', encoding='EUC-KR')

In [216]:
route.head(3)

    노선  편도운행
0  978   4.0
1  977   4.0
2  976   5.0

In [217]:
sumroute=route.groupby(by=['노선'], as_index=False).sum()

In [218]:
sumroute

       노선  편도운행
0     100  60.0
1    1000  24.0
2     101  49.0
3     102  32.0
4     103  31.0
..    ...   ...
121   973   5.0
122   974  18.0
123   976   5.0
124   977   4.0
125   978   4.0

[126 rows x 2 columns]

In [219]:
number=sumroute['노선']

In [220]:
편도2=900/sumroute['편도운행']

In [221]:
편도2=편도2.to_frame()

In [222]:
편도2

           편도운행
0     15.000000
1     37.500000
2     18.367347
3     28.125000
4     29.032258
..          ...
121  180.000000
122   50.000000
123  180.000000
124  225.000000
125  225.000000

[126 rows x 1 columns]

In [223]:
newroute=pd.concat([number,편도2], axis=1)

In [224]:
newroute.to_csv("newroute1.csv",encoding='utf-8')

In [225]:
newroute.head(3)

     노선       편도운행
0   100  15.000000
1  1000  37.500000
2   101  18.367347

In [226]:
newroute_df = newroute['편도운행'] >= 180

In [227]:
newroute_180 = newroute[newroute_df]

In [228]:
newroute_180.head(3)

     노선   편도운행
7   109  450.0
9    12  180.0
11  131  180.0

In [229]:
newroute_180.set_index('노선',inplace=True)

In [230]:
newroute_180.to_csv("newroute_180.csv",encoding='utf-8')